<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Munki recipe for Druva InSync</string>
	<key>Description</key>
	<string>Downloads the latest version of inSyncClient and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.joncrain.munki.inSyncClient</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Druva inSync</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>inSyncClient</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Druva inSync.app</string>
				<string>Uninstall inSync.app</string>
				<string>inSync Helper.app</string>
				<string>inSync Helper (GPU).app</string>
				<string>inSync.app</string>
				<string>inSyncSAMLWebView.app</string>
				<string>inSync Helper (Renderer).app</string>
				<string>inSync Helper (Plugin).app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string> </string>
			<key>developer</key>
			<string>Druva Technologies PTE LTD</string>
			<key>display_name</key>
			<string>inSyncClient</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.joncrain.download.inSyncClient</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
