<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of PlasticSCM - Cloud Edition.
		ARCHITECTURE options are x86_64 and arm64. Defaults to arm64 if not overridden.
		url for x86_64: https://www.plasticscm.com/download/downloadinstaller/%version%/plasticscm/macosx/cloudedition
		url for arm64: https://www.plasticscm.com/download/downloadinstaller/%version%/plasticscm/macosx/cloudeditionarm
	</string>
	<key>Identifier</key>
	<string>com.github.joncrain.download.PlasticSCM-cloud</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PlasticSCM-cloud</string>
		<key>URL</key>
		<string>https://www.plasticscm.com/download</string>
		<key>ARCHITECTURE</key>
		<string>arm64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7.6</string>
	<key>Process</key>
	<array>
		<!-- <dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe will soon be moved to Unity VCS.</string>
			</dict>
		</dict> -->
		<dict>
			<key>Processor</key>
			<string>FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>arm64</string>
				<key>input_string</key>
				<string>%ARCHITECTURE%</string>
				<key>replace</key>
				<string>arm</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>x86_64</string>
				<key>input_string</key>
				<string>%output_string%</string>
				<key>replace</key>
				<string></string>
				<key>result_output_var_name</key>
				<string>DOWNLOAD_ARCH</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>x86_64</string>
				<key>input_string</key>
				<string>%ARCHITECTURE%</string>
				<key>replace</key>
				<string>x64</string>
				<key>result_output_var_name</key>
				<string>ARCHITECTURE</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%URL%</string>
				<key>re_pattern</key>
				<string>download/(?P&lt;version&gt;([0-9_.]+[0-9_.]+[0-9_.]+[0-9_.]))</string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.zip</string>
				<key>url</key>
				<string>%URL%/downloadinstaller/%version%/plasticscm/macosx/cloudedition%DOWNLOAD_ARCH%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Codice Software (BQ7R3Y4J72)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/unity-vcs-osx-%ARCHITECTURE%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/unity-vcs-osx-%ARCHITECTURE%-%version%.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/com.codicesoftware.plasticscm.macplastic.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/PlasticSCM.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
